package org.example.ui

fun printMainMenu() {
    println("==============================")
    println("Меню модуля \"Учет финансов\"")
    println("1. Управление счетом")
    println("2. Управление категориями")
    println("3. Управление операциями")
    println("4. Аналитика")
    println("5. Выход")
    println("==============================")
}

fun printBAManagerMenu() {
    println("================================")
    println("Меню управления счетом")
    println("1. Создать счет")
    println("2. Изменить баланс")
    println("3. Удалить счет")
    println("4. Получить список счетов")
    println("5. Экспорт данных")
    println("6. Импорт данных")
    println("7. Назад")
    println("==============================")
}

fun printCtgManagerMenu() {
    println("================================")
    println("Меню управления категорией")
    println("1. Создать категорию")
    println("2. Изменить категорию")
    println("3. Удалить категорию")
    println("4. Получить список категорий")
    println("5. Экспорт данных")
    println("6. Импорт данных")
    println("7. Назад")
    println("==============================")
}

fun printOpsManagerMenu() {
    println("================================")
    println("Меню управления операцией")
    println("1. Создать операцию")
    println("2. Изменить операцию")
    println("3. Удалить операцию")
    println("4. Получить список операций")
    println("5. Экспорт данных")
    println("6. Импорт данных")
    println("7. Назад")
    println("==============================")
}

fun printAnalyticsManagerMenu() {
    println("=======================================")
    println("Меню аналитики")
    println("1. Разница доходов и расходов за период")
    println("2. Отчет по категориям")
    println("3. Назад")
    println("=======================================")
}

fun printExportMenu() {
    println("=======================================")
    println("Меню экспорта")
    println("1. Экспорт данных в CSV")
    println("2. Экспорт данных в JSON")
    println("3. Назад")
    println("=======================================")
}